app/controllers/rooms_controller.rb

  def index
    @rooms = Room.all
---
SELECT "rooms".* FROM "rooms"

  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save
---
INSERT INTO "rooms" ("topic", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["topic", "first room"], ["created_at", "2017-09-16 16:12:33.376043"], ["updated_at", "2017-09-16 16:12:33.376043"]]

    def set_room
      @room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]